{"config": [{"config": {"output_dim": 50, "batch_input_shape": [null, 10], "W_constraint": null, "input_dtype": "int32", "name": "embedding_3", "dropout": 0.0, "W_regularizer": null, "init": "uniform", "input_dim": 5000, "trainable": true, "activity_regularizer": null, "input_length": 10, "mask_zero": false}, "class_name": "Embedding"}, {"config": {"mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "trainable": true, "name": "batchnormalization_8", "momentum": 0.99, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"return_sequences": false, "output_dim": 100, "stateful": false, "dropout_U": 0.0, "W_regularizer": null, "dropout_W": 0.0, "unroll": false, "name": "simplernn_3", "U_regularizer": null, "b_regularizer": null, "consume_less": "gpu", "init": "glorot_uniform", "input_dim": 50, "trainable": true, "inner_init": "orthogonal", "input_length": null, "go_backwards": false, "activation": "tanh"}, "class_name": "SimpleRNN"}, {"config": {"output_dim": 100, "activation": "relu", "W_constraint": null, "name": "dense_8", "bias": true, "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "input_dim": 100, "trainable": true, "activity_regularizer": null, "b_constraint": null}, "class_name": "Dense"}, {"config": {"mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "trainable": true, "name": "batchnormalization_9", "momentum": 0.99, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_6"}, "class_name": "Dropout"}, {"config": {"output_dim": 20, "activation": "relu", "W_constraint": null, "name": "dense_9", "bias": true, "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "input_dim": 100, "trainable": true, "activity_regularizer": null, "b_constraint": null}, "class_name": "Dense"}, {"config": {"mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "trainable": true, "name": "batchnormalization_10", "momentum": 0.99, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_7"}, "class_name": "Dropout"}, {"config": {"output_dim": 1, "activation": "relu", "W_constraint": null, "name": "dense_10", "bias": true, "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "input_dim": 20, "trainable": true, "activity_regularizer": null, "b_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}